# Комментарии чрезвычайно полезны в любом языке программирования. До сих пор 
# ваши программы состояли только из кода Python. По мере роста объема и 
# сложности кода в программы стоит добавлять комментарии, описывающие общий 
# подход к решаемой задаче, - своего рода заметки, написанные на понятном языке.

# В языке Python признаком комментария является символ решетка (#). 
# Интерпретатор Python игнорирует все символы, следующие в коде после # до конца 
# строки.

# Say hello to everyone.
print("Hello Python people!")

# Главная задача комментария - объяснить, что должен делать ваш код и как он 
# работает. В разгаре работы над проектом вы понимаете, как работает все его 
# компоненты. Но если вернутся к проекту спустя некоторое время, скореее всего, 
# некоторые подробности будут забыты. Конечно, всегда можнон изучить код и 
# разобратся в том, как должны работать его части, но хорошие комментарии с 
# доступным изложением общих принципов работы кода сэкономят немало времени.

# Если вы хотите стать профессиональным программистом или учавствовать в 
# совместной работе с другими программистами, научитесь писать осмысленные 
# комментарии. В наши дни почти все программы разрабатываются коллективно в 
# группах - либо группами работников одной компании, либо группами энтузиастов, 
# совместно работающих над проектом с открытым кодом. Опытные программисты 
# ожидают увидеть комментарии в коде, поэтому лучше привыкайте добавлять 
# содержательные комментарии прямо сейчас. Написание простых, лаконичных 
# комментариев - одна из самых полезных привычек, необходимых начинающему 
# программисту.

