# Прежде чем написать первую программу, создайте где-нибудь в своей системе 
# папку с именем python_work для своих проектов. В именах файлов и папок лучше 
# использовать буквы нижнего регистра и символы подчеркивания в соотетствии со 
# схемой выбора имен в Python.

# Откройте редактор кода и сохраните пустой файл Python с именем hello_world.py 
# в папке python_work. Расширение .py сообщает редактору, что код в файле 
# написан на языке Python; эта информация помогает редактору запустить программу
# и правильно выделить цветом элементы синтаксиса. 

# Суффикс .py в имени hello_world.py указывает, что файл является программой 
# Python. Редактор запускает файл в интерпретаторе python, который читает 
# программу и определяет, что значит каждое слово в программе. Во время 
# написания программы редактор выделяет цветом разные части программы.

# Во время написания программы редактор выделяет цветом разные части кода. 
# Например, он понимает, что print является именем функции, и выводит это слово 
# одним цветом. С другой стороны, "Hello Python world!" не является кодом Python
# поэтому текст выделяется другим цветом. Этот механизм, называемый цветовым 
# выделением синтаксиса, сильно поможет вам, когда вы возьметесь за 
# самостоятельное программирование. 

print("Hello world!") # вывод информации в консоль
