# В каждой переменной хранится значение, то есть данные, связанные
# с переменной. Имена переменных могут состоять только из букв, цифр
# и символов подчеркивания. Они могут начинатся с буквы или символа 
# подчеркивания, но не с цифры. Пробелы в именах переменных запрещены,
# а для разделения слов в именах переменных используются сиволы 
# подчеркивания. Нельзя использовать имена функций и ключевые слова python
# в качестве имен переменных. Имена должны быть короткими, но 
# содержательными. 

name = "ada lovelace" # создание переменной

print(name) # вывод переменной

print(name.title()) # метод - это функиця внутри класса, title - метод, который 
                    # делает первую букву каждого слова большой

print(name.upper()) # upper - метод, который делает все буквы большими

print(name.lower()) # lower - метод, который делает все буквы маленькими