# В программировании темрмином пропуск (whitespace) называются такие 
# непечатаемые символы, как пробелы, табуляции и символы конца строки. Пропуски
# структурируют текст, чтобы пользователю было удобнее читать его.
# print("Python")

# Для включения в текст позиции табуляции используется комбинация символов \t
# print("\tPython")

# Разрывы строк добавляются с помощью комбинации символов \n
# print("\nPython")

# Табуляции и разрывы строк могут сочетаться в тексте. Скажем, 
# последовательность "\n\t" приказывает Python начать текст с новой строки, в 
# начале которой распологается табуляция.
print("Languages:\n\tPython\n\tC\n\tJavaScript")